# Data Selection

1. df['col']
2. df[['col1','col2']]
3. df.iloc[0]
4. df.loc[0]

In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("test.csv")
df=data.copy()

In [3]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
#Returns columns with label "column name" as series
df["Name"]

0                                  Kelly, Mr. James
1                  Wilkes, Mrs. James (Ellen Needs)
2                         Myles, Mr. Thomas Francis
3                                  Wirz, Mr. Albert
4      Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                           ...
413                              Spector, Mr. Woolf
414                    Oliva y Ocana, Dona. Fermina
415                    Saether, Mr. Simon Sivertsen
416                             Ware, Mr. Frederick
417                        Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

In [5]:
#retun columns as a new DataFrame
df[['Name','Age','Ticket']]

                                             Name   Age              Ticket
0                                Kelly, Mr. James  34.5              330911
1                Wilkes, Mrs. James (Ellen Needs)  47.0              363272
2                       Myles, Mr. Thomas Francis  62.0              240276
3                                Wirz, Mr. Albert  27.0              315154
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  22.0             3101298
..                                            ...   ...                 ...
413                            Spector, Mr. Woolf   NaN           A.5. 3236
414                  Oliva y Ocana, Dona. Fermina  39.0            PC 17758
415                  Saether, Mr. Simon Sivertsen  38.5  SOTON/O.Q. 3101262
416                           Ware, Mr. Frederick   NaN              359309
417                      Peter, Master. Michael J   NaN                2668

[418 rows x 3 columns]

In [6]:
#selection by row position
df.iloc[0]

PassengerId                 892
Pclass                        3
Name           Kelly, Mr. James
Sex                        male
Age                        34.5
SibSp                         0
Parch                         0
Ticket                   330911
Fare                     7.8292
Cabin                       NaN
Embarked                      Q
Name: 0, dtype: object

In [7]:
#Selection by index position
df.loc[1]

PassengerId                                 893
Pclass                                        3
Name           Wilkes, Mrs. James (Ellen Needs)
Sex                                      female
Age                                        47.0
SibSp                                         1
Parch                                         0
Ticket                                   363272
Fare                                        7.0
Cabin                                       NaN
Embarked                                      S
Name: 1, dtype: object

In [8]:
#First row and all columns
df.iloc[0,:]

PassengerId                 892
Pclass                        3
Name           Kelly, Mr. James
Sex                        male
Age                        34.5
SibSp                         0
Parch                         0
Ticket                   330911
Fare                     7.8292
Cabin                       NaN
Embarked                      Q
Name: 0, dtype: object

In [9]:
#First element of first column
df.iloc[0,0]

892